
print("Пример:(a + b * c)^2" )
print("Пример: a - 4 * b / c" )
print("Пример: (a * b + 4) / (c - 1)" )
print("----------------------------------------------")
a=int(input("Введите переменную а"))
b= int(input("Введите переменную b"))
c= int(input("Введите переменную а"))
print("----------------------------------------------")
#1
print("Пример:(a + b * c)^2" )
print("-")
print("Решение:", (a+(b*c))**2)
print("-")
#2
print("Пример: a - 4 * b / c ")
print("-")
print("Решение:", (a - (4 * (b / c))))
print("-")
#3
print("Пример: (a * b + 4) / (c - 1)" )
print("-")
print("Решение:", ((a * b) + 4) / (c - 1))